Output of terraform plan for pilot-hubs cluster

```
Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # google_artifact_registry_repository.registry will be destroyed
  # (because resource uses count or for_each)
  - resource "google_artifact_registry_repository" "registry" {
      - create_time   = "2021-06-08T09:49:38.042891Z" -> null
      - format        = "DOCKER" -> null
      - id            = "projects/two-eye-two-see/locations/us-central1/repositories/pilot-hubs-registry" -> null
      - labels        = {} -> null
      - location      = "us-central1" -> null
      - name          = "pilot-hubs-registry" -> null
      - project       = "two-eye-two-see" -> null
      - repository_id = "pilot-hubs-registry" -> null
      - update_time   = "2021-06-08T09:49:38.042891Z" -> null
    }

  # google_artifact_registry_repository.registry["binder-staging"] will be created
  + resource "google_artifact_registry_repository" "registry" {
      + create_time   = (known after apply)
      + format        = "DOCKER"
      + id            = (known after apply)
      + location      = "us-central1"
      + name          = (known after apply)
      + project       = "two-eye-two-see"
      + repository_id = "binder-staging-registry"
      + update_time   = (known after apply)
    }

  # google_artifact_registry_repository.registry["pilot-hubs"] will be created
  + resource "google_artifact_registry_repository" "registry" {
      + create_time   = (known after apply)
      + format        = "DOCKER"
      + id            = (known after apply)
      + location      = "us-central1"
      + name          = (known after apply)
      + project       = "two-eye-two-see"
      + repository_id = "pilot-hubs-registry"
      + update_time   = (known after apply)
    }

  # google_project_iam_member.registry_sa_roles["binder-staging"] will be created
  + resource "google_project_iam_member" "registry_sa_roles" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "two-eye-two-see"
      + role    = "roles/artifactregistry.writer"
    }

  # google_project_iam_member.registry_sa_roles["pilot-hubs"] will be created
  + resource "google_project_iam_member" "registry_sa_roles" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "two-eye-two-see"
      + role    = "roles/artifactregistry.writer"
    }

  # google_service_account.registry_sa["binder-staging"] will be created
  + resource "google_service_account" "registry_sa" {
      + account_id   = "binder-staging-registry-sa"
      + disabled     = false
      + display_name = "Service account to manage images in GAR repo binder-staging"
      + email        = (known after apply)
      + id           = (known after apply)
      + name         = (known after apply)
      + project      = "two-eye-two-see"
      + unique_id    = (known after apply)
    }

  # google_service_account.registry_sa["pilot-hubs"] will be created
  + resource "google_service_account" "registry_sa" {
      + account_id   = "pilot-hubs-registry-sa"
      + disabled     = false
      + display_name = "Service account to manage images in GAR repo pilot-hubs"
      + email        = (known after apply)
      + id           = (known after apply)
      + name         = (known after apply)
      + project      = "two-eye-two-see"
      + unique_id    = (known after apply)
    }

  # google_service_account_key.registry_sa_keys["binder-staging"] will be created
  + resource "google_service_account_key" "registry_sa_keys" {
      + id                 = (known after apply)
      + key_algorithm      = "KEY_ALG_RSA_2048"
      + name               = (known after apply)
      + private_key        = (sensitive value)
      + private_key_type   = "TYPE_GOOGLE_CREDENTIALS_FILE"
      + public_key         = (known after apply)
      + public_key_type    = "TYPE_X509_PEM_FILE"
      + service_account_id = (known after apply)
      + valid_after        = (known after apply)
      + valid_before       = (known after apply)
    }

  # google_service_account_key.registry_sa_keys["pilot-hubs"] will be created
  + resource "google_service_account_key" "registry_sa_keys" {
      + id                 = (known after apply)
      + key_algorithm      = "KEY_ALG_RSA_2048"
      + name               = (known after apply)
      + private_key        = (sensitive value)
      + private_key_type   = "TYPE_GOOGLE_CREDENTIALS_FILE"
      + public_key         = (known after apply)
      + public_key_type    = "TYPE_X509_PEM_FILE"
      + service_account_id = (known after apply)
      + valid_after        = (known after apply)
      + valid_before       = (known after apply)
    }

Plan: 8 to add, 0 to change, 1 to destroy.

Changes to Outputs:
  + registry_sa_keys = (sensitive value)
```